import { Component, OnInit } from '@angular/core';
import { ProductService } from '../product.service';

@Component({
  selector: 'app-index-page',
  templateUrl: './index-page.component.html',
  styleUrls: ['./index-page.component.scss']
})
export class IndexPageComponent implements OnInit {

  productList: any = []
  constructor(private productService: ProductService) {

  }
  ngOnInit(): void {
    this.getProductList()
  }

  getProducts(category: string = 'all') { //กำหนดค่าเป็น all คือไม่ระบุหมวดหมู่
    const products = [
      {
        productId: 1,
        imgSrc: './assets/kaniva1.jpg',
        name: 'Kaniva Dog : สูตรเนื้อไก่ 1.5kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: 'dog',
        price: 235
      },
      {
        productId: 2,
        imgSrc: './assets/kaniva2.jpg',
        name: 'Kaniva Dog : สูตรแซลมอน 11kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: 'dog',
        price: 1390
      },
      {
        productId: 3,
        imgSrc: './assets/dog-3.jpg',
        name: 'SmartHeartGold : ลูกสุนัข สูตรแซลมอนมีลแอนด์ไรซ์ 15kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: 'dog',
        price: 2160
      },
      {
        productId: 4,
        imgSrc: './assets/dog-4.jpg',
        name: 'SmartHeartGold : สุนัขโต สูตรแซลมอนมีลแอนด์ไรซ์ 15kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: 'dog',
        price: 2160
      },
      {
        productId: 5,
        imgSrc: './assets/kaniva-cat1.jpg',
        name: 'Kaniva Cat : สูตรแซลมอน 2.8kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "cat",
        price: 549
      },
      {
        productId: 6,
        imgSrc: './assets/kaniva-cat2.jpg',
        name: 'Kaniva Cat : สูตรไก่และไข่ 2.8kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "cat",
        price: 549
      },
      {
        productId: 7,
        imgSrc: './assets/cat-3.jpg',
        name: 'A Pro : สำหรับลูกแมว 20kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "cat",
        price: 1225
      },
      {
        productId: 8,
        imgSrc: './assets/cat-4.jpg',
        name: 'A Pro : สำหรับแมวอายุ 1 ปีขึ้นไป 20kg',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "cat",
        price: 1225
      },
      {
        productId: 9,
        imgSrc: './assets/small-1.jpg',
        name: 'SmartHeartGold : อาหารหนูแฮมสเตอร์ สูตรคอมพลีทแอนด์บาลานซ์ 300g',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "smallpets",
        price: 100
      },
      {
        productId: 10,
        imgSrc: './assets/small-2.jpg',
        name: 'SmartHeartGold : ขนมหนูแฮมสเตอร์ สูตรบำรุงขน 100g',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "smallpets",
        price: 94
      },
      {
        productId: 11,
        imgSrc: './assets/small-3.jpg',
        name: 'SmartHeartGold : อาหารกระต่าย สำหรับกระต่ายโต 300g',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "smallpets",
        price: 230
      },
      {
        productId: 12,
        imgSrc: './assets/small-4.jpg',
        name: 'SmartHeartGold : อาหารกระต่าย มูสลี่ 300g',
        details: 'พูดความจริงออกมา ฮ่าฮ่าฮ่าฮ่าฮ่า ในที่สุด!! ฉันก็ทำให้แกโดนไล่ออกจนได้ คุณหญิงแม่ต้องภูมิใจในตัวฉันแต่ๆเลยอ่ะ ฮ่าฮ่าฮ่าฮ่าฮ่า พูดอะไรอ่ะ ฉันเปล่านิ ฮ่าฮ่าฮ่าฮ่าฮ่า คราวนี้ก็เหลือแต่นังธารใส! ฉันจะกำจัดให้พ้นเชนยังไงดีน้า ปล่อยคลิปดิสเครดิตก็แล้ว ยังจะหน้าด้านอยู่ได้!! ฮ่าฮ่าฮ่า',
        category: "smallpets",
        price: 180
      }
    ];

    if (category === 'all') {
      return products;
    }

    return products.filter(product => product.category === category); // จะใช้ sort product อีกที 
  }

  getProductList() {
    this.productService.getProducts() // เรียก getProductById จาก productService เพื่อดึงข้อมูลสินค้า
      .subscribe((product: any) => { // รับข้อมูลสินค้าที่ได้
        // this.product = product;
        this.productList = product
        console.log(product)
      });
  }

  getProductById(id: number): any { //ค้นหาสินค้าโคยใช้ productId 
    const products = this.getProducts();
    return products.find(product => product.productId === id); //จะ return สินค้าที่พบ โดยหาจาก Id ใน Products
    //product = item
  }
}

